Week 03/20160120-Lecture-05.tex
% Created 2016-01-20 Wed 12:14
\documentclass[letter,twoside,twocolumn]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Ryan Sharif}
\date{\today}
\title{Harmony}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Rhythm continued}
\label{sec-1}
\subsection{Sinfonia, Bach No. 5, Allegro}
\label{sec-1-1}
This is a compound meter example. This is an example of a duple song.

\subsection{Ancient Airs and Dances}
\label{sec-1-2}

\subsubsection{First example}
\label{sec-1-2-1}
This song has an example of a melody that occurs on the first and fourth
beat. The bassoon plays the bass line of this song. 
\subsubsection{Second example}
\label{sec-1-2-2}
The song has competing rhythms.

\subsection{Every time you say goodbye, country music song}
\label{sec-1-3}
Instrumental introduction followed by a verse. There's
an extra beat at the first line of the chorus, followed
by regularity once again.

\section{Harmony}
\label{sec-2}
\subsection{definitions}
\label{sec-2-1}
\emph{harmony}: simulataneous events in music; dimension of depth; combining
of notes to produce chords, and successively, to produce chord progressions. \\

\emph{chord}: three of four notes sounded together, usually alternate notes of a scale.
 Less than three notes is not a definitive harmony, it merely suggests a harmony.
 Greater than four notes form complex harmonies, harmonies that can be broken up. \\

\emph{triad}: a three note chord \\

\emph{tetrad}: a four note chord \\

\emph{tonic}: the tonal center, along with the dominate forms the \ldots{} \\

\emph{sub-dominate}: \\

\emph{dominate}: \\

\emph{disonance}: sounds that create conflict; these chords are unstable. \\

\emph{consonance}: sounds that go well together; these chords are stable. \\

\emph{drone}: a bass chord that never changes; part of medieval western music. \\

\emph{block chords}: notes sounded together \\

\emph{argpeggiated chords}: harmony achieved by playing notes successively \\

C-Major chord: 1 - 3 - 5

Chords are built on stacked thirds and can have their own rhythm.
\subsection{Pre-renaissance}
\label{sec-2-2}
The concept of harmony was not really understood or studied before
the renaissance. Harmony was thus an accident of melody. And the closer
you get to the renaissance, the more composers were focusing on the
vertical aspect of melodic interaction.
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
